Revit 2024 API
BuiltInFailures.LevelFailures.StoryAboveNonStoryLevel Property
 The level set as the Story Above for these levels is no longer a story level. This change will cause these levels to revert to the default Story Above.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StoryAboveNonStoryLevel { get; }
Visual Basic
Public Shared ReadOnly Property StoryAboveNonStoryLevel As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StoryAboveNonStoryLevel {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.LevelFailures Class
Autodesk.Revit.DB Namespace